Suilarso/Aztech/MSP430G2553_PLC_iSwitch/dali.c
/******************************************************************************/
// dali.c                                                                     
// defines functions called by application as well as functions for the       
// Manchester encoding phy and the address decoding                           
//                                                                            
// Functions called by main application                                       
//    void TI_DALI_Init(void)                                                 
//    void TI_DALI_Transaction_Loop(void)
//    void TI_DALI_Flash_Update(unsigned int)                                          
//                                                                            
// Functions called by TI_Dali_Transaction_Loop  
//    void TI_DALI_Reset_Check(void)  
//    void TI_DALI_Tx(unsigned char)                                
//    unsigned char TI_DALI_Rx(unsigned char *rx_msg)                                             
//    unsigned char TI_DALI_Match_Address(unsigned char)      
//    unsigned char TI_DALI_Command(unsigned char*)
//    unsigned char TI_DALI_Special_Command(unsigned char*)  
//    void TI_DALI_Update_Callback(void);
//    void TI_DALI_Idle_Callback(void);
//                              
// ISR                                                                            
// #pragma vector=WDT_VECTOR                                                  
//                                                                            
// Chris Sterzik                                                                
// Texas Instruments                                                          
// Built with CCS Version: 4.0.1.01000                                        
//                                                                            
// Revision 1.0    Baseline                                         
/******************************************************************************/

// THIS PROGRAM IS PROVIDED "AS IS". TI MAKES NO WARRANTIES OR
// REPRESENTATIONS, EITHER EXPRESS, IMPLIED OR STATUTORY,
// INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS
// FOR A PARTICULAR PURPOSE, LACK OF VIRUSES, ACCURACY OR
// COMPLETENESS OF RESPONSES, RESULTS AND LACK OF NEGLIGENCE.
// TI DISCLAIMS ANY WARRANTY OF TITLE, QUIET ENJOYMENT, QUIET
// POSSESSION, AND NON-INFRINGEMENT OF ANY THIRD PARTY
// INTELLECTUAL PROPERTY RIGHTS WITH REGARD TO THE PROGRAM OR
// YOUR USE OF THE PROGRAM.
//
// IN NO EVENT SHALL TI BE LIABLE FOR ANY SPECIAL, INCIDENTAL,
// CONSEQUENTIAL OR INDIRECT DAMAGES, HOWEVER CAUSED, ON ANY
// THEORY OF LIABILITY AND WHETHER OR NOT TI HAS BEEN ADVISED
// OF THE POSSIBILITY OF SUCH DAMAGES, ARISING IN ANY WAY OUT
// OF THIS AGREEMENT, THE PROGRAM, OR YOUR USE OF THE PROGRAM.
// EXCLUDED DAMAGES INCLUDE, BUT ARE NOT LIMITED TO, COST OF
// REMOVAL OR REINSTALLATION, COMPUTER TIME, LABOR COSTS, LOSS
// OF GOODWILL, LOSS OF PROFITS, LOSS OF SAVINGS, OR LOSS OF
// USE OR INTERRUPTION OF BUSINESS. IN NO EVENT WILL TI'S
// AGGREGATE LIABILITY UNDER THIS AGREEMENT OR ARISING OUT OF
// YOUR USE OF THE PROGRAM EXCEED FIVE HUNDRED DOLLARS
// (U.S.$500).
//
// Unless otherwise stated, the Program written and copyrighted
// by Texas Instruments is distributed as "freeware".  You may,
// only under TI's copyright in the Program, use and modify the
// Program without any charge or restriction.  You may
// distribute to third parties, provided that you transfer a
// copy of this license to the third party and the third party
// agrees to these terms by its first use of the Program. You
// must reproduce the copyright notice and any other legend of
// ownership on each copy or partial copy, of the Program.
//
// You acknowledge and agree that the Program contains
// copyrighted material, trade secrets and other TI proprietary
// information and is protected by copyright laws,
// international copyright treaties, and trade secret laws, as
// well as other intellectual property laws.  To protect TI's
// rights in the Program, you agree not to decompile, reverse
// engineer, disassemble or otherwise translate any object code
// versions of the Program to a human-readable form.  You agree
// that in no event will you alter, remove or destroy any
// copyright notice included in the Program.  TI reserves all
// rights not specifically granted under this license. Except
// as specifically provided herein, nothing in this agreement
// shall be construed as conferring by implication, estoppel,
// or otherwise, upon you, any license or other right under any
// TI patents, copyrights or trade secrets.
/******************************************************************************/
#include "dali.h"
#include "msp430x21x1.h"
#include "global_var.h"  //SJ5100812 - Added by SJ
#include "command.h"  //SJ5070912 - Added by SJ


//SJ5070912 - External function prototype ---------------------------
//PLC_Lite.c
extern void AZ_DALI_Response(int response_type);

//PLC_Comm.c
extern void CRC16_UpdateChecksum(unsigned short *pcrcvalue, const void *data, int length);

//SJ5100812 - External global variables declaration ------------------
//PLC_iSwitch.c
extern unsigned char ggeneral_buffer[DATA_BUFFER_SZ];
#ifdef SWITCH_CONTROLLER
extern unsigned char gswitch_oper[SWITCH_OPER_SZ];
#endif
extern STATE_STRUCT  gstate_var;

/*** DALI Constants ***********************************************************/
const unsigned char min_fast_fade_time = 11;
const unsigned char gear_type = 0;
const unsigned char possible_operating_modes = 0;
const unsigned char features = 0;
const unsigned char version_number = 0;
const unsigned char extended_version_number=1;
#if 0  //SJ2111212 - ORG
const unsigned char device_type = 6;       /* Device type 6, device for LEDs */
#else  //SJ2111212 - Replaced. To allow sharing of code between Switch controller and lighting controller
const unsigned char device_type = DEVICE_TYPE;       /* Device type 6, device for LEDs */
#endif
const unsigned char phys_min_lvl = PHYS_MIN_LEVEL;  //SJ5140912  #define PHYS_MIN_LEVEL 90 defined in dali.h
/*** Memory Bank 0 *************************************************************/
const unsigned char memory_bank_0[15] = 
{ 
  LAST_BNK0_ADDR,
  CHKSUM_BNK0,
  LAST_BNK,
  GTIN_0,
  GTIN_1,
  GTIN_2,
  GTIN_3,
  GTIN_4,
  GTIN_5,
  FRMWR_VER_0,
  FRMWR_VER_1,
  SERIAL_1,
  SERIAL_2,
  SERIAL_3,
  SERIAL_4
};
/*** DALI Global RAM Variables ************************************************/
unsigned char power_on_level;
unsigned char actual_level;
/* SEARCH_ADDRESS and RANDOM_ADDRESS are defined in the DALI standard.  While */
// the strict definintion is not followed the funtionality is provided with
// three other variables (low, middle, and high) for each.                 
//unsigned long int search_address = SEARCH_ADDRES_DEFAULT;
//unsigned long int random_address = RANDOM_ADDRES_DEFAULT;
unsigned char search_address_byte_h;
unsigned char search_address_byte_m;
unsigned char search_address_byte_l;
unsigned char random_address_byte_h;
unsigned char random_address_byte_m;
unsigned char random_address_byte_l;
unsigned char system_failure_level;
unsigned char min_level;
unsigned char max_level;
unsigned char fade_rate;  
unsigned char fade_time;
unsigned char fast_fade_time;
unsigned char short_address;
unsigned char group_0_7;
unsigned char group_8_f;
unsigned char scene[16];
unsigned char status_information;
unsigned char data_transfer_register;
unsigned char data_transfer_register1;
unsigned char data_transfer_register2;
unsigned char failure_status;
unsigned char operating_mode;
unsigned char dimming_curve;
/******************************************************************************/
// Additional Arc fade control global variables 
unsigned char target_level;
unsigned long fade_count;
unsigned int config_count;
unsigned long dapc_count;       /*Direct Arc Power Control */
unsigned long start_time;
unsigned long fade_step_size;
unsigned char *flash_ptr;
unsigned char flash_update_request;
unsigned long initialise_count;
unsigned char initialise_minute;
unsigned char idle_time;
unsigned char physical_selection=0;
unsigned char enable_device_type=0;
unsigned char *infoC_ptr;  //SJ3190912 - Added for PLC long address and CRC checksum
unsigned char *infoB_ptr;  //SJ5141212 - Added for switch operation
/******************************************************************************/
// TI_Dali_Init(unsinged char)                                     
//                      
/******************************************************************************/
void TI_DALI_Init(unsigned int key){
  volatile unsigned char i;
  //unsigned char *tmp_ptr;  //SJ3190912 - ORG. Not used in our project

 #if 0  //SJ4020812 - Not used in our project  
  /*** Setup P2.0 and P2.1 ****************************************************/
  P2DIR &= ~BIT0;       // Input P2.0
  P2SEL &= ~(BIT1+BIT0);
  P2IE &= ~(BIT1+BIT0);   //SJ3080611 - After negate P2IE will get 11111100
  P2DIR |= BIT1;        // Output high P2.1 (IDLE)
  P2OUT |= BIT1;        // HW configuration will short bus lines 
                        //(opto-relay on daughter board) when P2.1 is low
                        // this will be used for TX function.
 #endif

  /*** Setup Memory and non-volatile variables ********************************/
  // Data exists in either INFO memory B,C, or D depending on what was last 
  // written to the information memory space. After a factory program of flash
  // only INFOD will be programmed with the factory defaults.  The in system 
  // flash routine in addition to this intitialization routine will provide a 
  // cyclical buffer in the information memory. The valid range of the 
  // MAX_LEVEL is min_level to 254 if MAX_LEVEL = 255 then that portion of the
  // segment is empty.
 #if 0  //SJ5140912 - ORG. TI DALI.
  flash_ptr = (unsigned char *)INFO_B2;  //SJ1060611 - equiv 0x10A0
  tmp_ptr = (unsigned char *)INFO_D1;    //SJ1060611 - equiv 0x1000
  while((flash_ptr[MAX_LEVEL] == MASK))  //SJ1030912 - MAX_LEVEL is 3
  {
    flash_ptr = flash_ptr - DATA_SIZE;  //SJ5240812 - 0x10A0 - 32 = 0x1080, 0x1060, 0x1040, 0x1020, 0x1000
    if((flash_ptr < (unsigned char *)LOWEST_INFO_SPACE))  //SJ1060611 - equiv 0x1000
    {
      while(1);    //trap cpu, device has lost even the factory default settings
    }
  }
  //SJ5140912 - SJNOTE: If section info_b and info_c are empty, flash_ptr should be 0x1000 after this point
  // There is a special case when the data was written to D1 from B2
  // (segment C is erased)
  if((flash_ptr == (unsigned char *)INFO_B2) && (tmp_ptr[MAX_LEVEL] != MASK))  //SJ5140912 - true if both INFO_B2 and INFO_D1 are used.
  flash_ptr = tmp_ptr;
 #else  //SJ5140912 - Replaced. Aztech
  unsigned short crcvalue=0;
  unsigned short stored_crc=0;
  //const void *data

  flash_ptr = (unsigned char *)INFO_D1;  //SJ5140912 - equiv 0x1000
  infoC_ptr = (unsigned char *)INFO_C1;  //SJ3190912 - equiv 0x1040
  infoB_ptr = (unsigned char *)INFO_B1;  //SJ5141212 - equiv 0x1080

  //CRC16_UpdateChecksum(&crcvalue, (const void *) 0x1000, DATA_SIZE);
  CRC16_UpdateChecksum(&crcvalue, (const void *) flash_ptr, DATA_SIZE);

