Suilarso/Aztech/MSP430G2553_PLC_iSwitch/dali.c
//0x1048
//#define CRC_CHECKSUM_MSB      8
//#define CRC_CHECKSUM_LSB      9
  stored_crc = (unsigned short) ((infoC_ptr[CRC_CHECKSUM_MSB] << 8) + infoC_ptr[CRC_CHECKSUM_LSB]);  //SJ3190912 - Retrieve CRC checksum from InfoC (0x1040)
  if (stored_crc == crcvalue)
  //if (1)
  {	//power_on_level = 0;
 #endif
  power_on_level = flash_ptr[POWER_ON_LEVEL];              //SJ1060611 - equiv 0

  /* Initialize RAM variables */
  system_failure_level = flash_ptr[SYSTEM_FAILURE_LEVEL];  //SJ1060611 - equiv 1
  min_level = flash_ptr[MIN_LEVEL];                        //SJ1060611 - equiv 2
  max_level = flash_ptr[MAX_LEVEL];                        //SJ1060611 - equiv 3
  fade_rate = flash_ptr[FADE_RATE];                        //SJ1060611 - equiv 4
  fade_time = flash_ptr[FADE_TIME];                        //SJ1060611 - equiv 5
  #if 0  //SJ3190912 - ORG. DALI
  short_address = flash_ptr[SHORT_ADDRESS];                //SJ1060611 - equiv 6
  #else  //SJ3190912 - Replaced. Aztech
  short_address = infoC_ptr[PLC_LONG_ADDR_1_LOC];  //SJ3190912 - Retrieve DALI short address from Info C.
    //SJ2111212 - iSwitch ----------
    #if 0//def I_SWITCH_PROJECT  //SJ1171212 - No longer needed as room ID is determined by DIP switch
      gstate_var.Room_ID = (infoC_ptr[ROOM_ID_MSB_LOC] << 8) + infoC_ptr[ROOM_ID_LSB_LOC];
    #endif
    //SJ2111212 - End of iSwitch ---
  #endif
  group_0_7 = flash_ptr[GROUP_0_7];                        //SJ1060611 - equiv 7
  group_8_f = flash_ptr[GROUP_8_F];                        //SJ1060611 - equiv 8
  for(i=0;i<NUMBER_OF_SCENES;i++)
  {
    scene[i] = flash_ptr[i+SCENE_0];                       //SJ1060611 - equiv 9 - 24
  }
  random_address_byte_h = flash_ptr[RANDOM_ADDRESS_H];     //SJ1060611 - equiv 25
  random_address_byte_m = flash_ptr[RANDOM_ADDRESS_M];     //SJ1060611 - equiv 26
  //random_address_byte_h = flash_ptr[RANDOM_ADDRESS_L];     //SJ1060611 - equiv 27  //SJ2120612 - Why random_address_byte_h???? Is it typo error???
  random_address_byte_l = flash_ptr[RANDOM_ADDRESS_L];     //SJ1060611 - equiv 27  //SJ1130812 - 
  fast_fade_time = flash_ptr[FAST_FADE_TIME];              //SJ1060611 - equiv 28
  failure_status = (flash_ptr[FAILURE_STATUS] & 0x80);     //SJ1060611 - equiv 29
  operating_mode = (flash_ptr[OPERATING_MODE] & 0x10);     //SJ1060611 - equiv 30
  dimming_curve = flash_ptr[DIMMING_CURVE];                //SJ1060611 - equiv 31

 #if 1  //SJ4200912 - Restore default value in case flash is corrupted
  //flash_update_request = 0;
  }
  else
  {
    power_on_level = POWER_ON_LEVEL_DEFAULT;              //SJ4200912 - equiv 254
    system_failure_level = SYSTEM_FAILURE_LEVEL_DEFAULT;  //SJ4200912 - equiv 254
    min_level = MIN_LEVEL_DEFAULT;                        //SJ4200912 - equiv 90
    max_level = MAX_LEVEL_DEFAULT;                        //SJ4200912 - equiv 254
    fade_rate = FADE_RATE_DEFAULT;                        //SJ4200912 - equiv 7
    fade_time = FADE_TIME_DEFAULT;                        //SJ4200912 - equiv 0
    short_address = 0;//infoC_ptr[PLC_LONG_ADDR_1_LOC];       //SJ4200912 - Retrieve DALI short address from Info C.
    //SJ2111212 - iSwitch ----------
    #if 0//def I_SWITCH_PROJECT  //SJ1171212 - No longer needed as room ID is determined by DIP switch
      gstate_var.Room_ID = 0;//(infoC_ptr[ROOM_ID_MSB_LOC] << 8) + infoC_ptr[ROOM_ID_LSB_LOC];
    #endif
    //SJ2111212 - End of iSwitch ---
    group_0_7 = GROUP_0_7_DEFAULT;                        //SJ4200912 - equiv 0x00
    group_8_f = GROUP_8_F_DEFAULT;                        //SJ4200912 - equiv 0x00
    for(i=0;i<NUMBER_OF_SCENES;i++)
    {
      scene[i] = SCENE_0_F_DEFAULT;                       //SJ4200912 - equiv 254
    }
    random_address_byte_h = RANDOM_ADDR_BYTE_DEFAULT;     //SJ4200912 - equiv 0xFF
    random_address_byte_m = RANDOM_ADDR_BYTE_DEFAULT;     //SJ4200912 - equiv 0xFF
    random_address_byte_l = RANDOM_ADDR_BYTE_DEFAULT;     //SJ4200912 - equiv 0xFF 
    fast_fade_time = FAST_FADE_TIME_DEFAULT;              //SJ4200912 - equiv 0
    failure_status = FAILURE_STATUS_DEFAULT;              //SJ4200912 - equiv 0
    operating_mode = OPERATING_MODE_DEFAULT;              //SJ4200912 - equiv 0
    dimming_curve = DIMMING_CURVE_DEFAULT;                //SJ4200912 - equiv 0

    //flash_update_request = 1;
    //gstate_var.flash_update_countdown = 10;//TIMER_30_SECONDS;
    //TI_DALI_Flash_Update(FWKEY);  //SJ4200912 - For debugging purpose
    TI_DALI_Flash_Update(FWKEY, 0);  //SJ1171212 - Write to segment 0x1000 and 0x1040, unsigned char wrt_area
  }
 #endif

  search_address_byte_h = MASK;  //SJ1060611 - equiv 0xFF
  search_address_byte_m = MASK;
  search_address_byte_l = MASK;
  fade_count=0;
  flash_update_request = 0;  //SJ4200912 - ORG. DO NOT REMOVE
  config_count=CONFIG_TIMEOUT;  //SJ1060611 - equiv 98
  dapc_count=DAPC_TIMEOUT;      //SJ1060611 - equiv 195
  initialise_count=INITIALISE_SEC+1;  //SJ1060611 - equiv 58594
  status_information = STATUS_INFO_DEFAULT;  //SJ2220512 - equiv 0x80 (STATUS_POWER_FAILURE is the default)

  #ifdef SWITCH_CONTROLLER  //SJ5141212 - For device type switch only
  if (device_type >= 11)
  {
      for(i=0; i<SWITCH_OPER_SZ; i++)
      {
        gswitch_oper[i] = infoB_ptr[i];
      }
  }
  #endif  //SJ5141212 - End

#if 0  //SJ2180912 - ORG. Skip.
  /* Update the flash_ptr so that call to the TI_DALI_Flash_Update writes to  */
  /* the correct location in Information memory. */
  if(flash_ptr  == (unsigned char *)HIGHEST_INFO_SPACE)  //SJ1060611 - equiv - 0x10A0
  {
   flash_ptr = (unsigned char *)LOWEST_INFO_SPACE;  //SJ1060611 - equiv - 0x1000
  }
  else
  {
   flash_ptr = flash_ptr+DATA_SIZE;  //SJ2040912 - If comes here, it will be 0x1020
  }
  /* Erase the previous segement in preparation for the next power cycle. */
  FCTL2 = key+FSSEL1+FN0;
  FCTL3 = key;
  FCTL1 = key+ERASE;
  if((flash_ptr == (unsigned char *)INFO_D2))
  {
  tmp_ptr = (unsigned char *)INFO_B1;
  tmp_ptr[POWER_ON_LEVEL] = 0; /* Dummy write segment B */
  }
  if((flash_ptr == (unsigned char *)INFO_C2))
  {
  tmp_ptr = (unsigned char *)INFO_D1;
  tmp_ptr[POWER_ON_LEVEL] = 0; /* Dummy write segment D */
  }
  if((flash_ptr == (unsigned char *)INFO_B2))
  {
  tmp_ptr = (unsigned char *)INFO_C1;
  tmp_ptr[POWER_ON_LEVEL] = 0; /* Dummy write segment C */
  }
  FCTL1 = key;
  FCTL3 = key+LOCK;
  key=0;
#endif

  /*** Setup WDT **************************************************************/
  WDTCTL = FADE_INTERVAL;  //SJ4300812 - equiv (WDT_MDLY_8 - SMCLK/8192), 1 second will goto ISR 977 times.
  IE1 |= WDTIE;

  actual_level = power_on_level;
  if(power_on_level<min_level)
  {
    actual_level = min_level;
  }
  if(power_on_level>max_level)
  {
    actual_level = max_level;
  }
  start_time = 0;  // Initialize timer.  If expires go to power on level.
} // END TI_Dali_Init()

/******************************************************************************/
// TI_Dali_Transaction_Loop                                                   
// This function gets the DALI received data, rx_msg[], calls the appropriate 
// decode function, execute_command or execute_special_command, and then calls
// back to the main application. After returning from the main application a  
// response transmission is sent if needed and then repeats.                  
/******************************************************************************/
void TI_DALI_Transaction_Loop(void)
{
  /* the information pushed onto the stack for this call is not needed */
  /* possibly adjust stact pointer?                                    */
  unsigned char bytes_received, command_type;
  static unsigned char rx_msg[VALID_BYTES];  //SJ2070611 - equiv 2
  static unsigned char response;
  //while (1)  //SJ4090812 - ORG. No need to loop forever here as this function is call from main loop
  {
      response=0;
      bytes_received=0;
      command_type = 0;
      bytes_received = TI_DALI_Rx(rx_msg);  //SJ4090812 - ORG. TI DALI
      //bytes_received = TI_DALI_Rx(&ggeneral_buffer[82]);  //SJ5100812 - Replaced. Using PLC DataTransfer packet
      if(bytes_received == SYSTEM_FAILURE)
      {
        status_information |= STATUS_POWER_FAILURE;
        status_information &= ~FADE_RUNNING;
        //arc_power_level(system_failure_level);
        /* check system_failure_level, if 255 (mask) then no change
        *  if a different value then go to that value without fading
        */
        if (system_failure_level != MASK)
        {
          /* Update both status and actual_level before WDT call*/
          IE1 &= ~WDTIE;   //SJ3080611 - Disable watchdog interval interrupt service routine???
          actual_level = system_failure_level;
          if(system_failure_level > max_level)
          {
            actual_level = max_level;
          }
          if(system_failure_level < min_level)
          {
            actual_level = min_level;
          }
          status_information |= LAMP_ARC_POWER_ON;
          status_information &= ~FADE_RUNNING;
          IE1 |= WDTIE;
          TI_DALI_Update_Callback();  //SJ3080611 - Routine's only sttmt: TACCTL1 |= CCIE; It enable ISR for PWM routine
        }
      }
      else if (bytes_received == VALID_BYTES)
      {
        /*Decode address*/
        command_type = TI_DALI_Match_Address(rx_msg[0]);  
        // if address is a match return a 1 or 2
        if(command_type == 1)  //SJ4090611 - Either a broadcast, Group, or Short address
        {
          response = TI_DALI_Command(rx_msg);
        }
        if(command_type == 2)  //SJ4090611 - Special commands
        {
          response = TI_DALI_Special_Command(rx_msg);

