Suilarso/Aztech/MSP430G2553_PLC_iSwitch/dali.c
        #if 0  //SJ4201212 - Added to acknowledge GUI the state of address assignment
          //if ((gstate_var.general_ctrl_flag & ATTACH_ON) && (rx_msg[0] == 0xB7))  //SJ4201212 - At the moment ignore 0xB7 1st
          if (gstate_var.general_ctrl_flag & ATTACH_ON)  //SJ4201212 - because ATTACH_ON is only assigned in 0xB7 of special_command.c
          {
            AZ_DALI_Response(0xB7);  //SJ5070912 #define GENERIC_QUERY  3 in PLC_Comm.h
            gstate_var.general_ctrl_flag &= ATTACH_OFF;  //SJ4201212 - Clear acknowledgement flag
          }
        #endif
        }
        if(response)
        {
          /* Respond, if the response is 'NO', then control gear does not     */
          /* react. The response must occur between 7 and 22 TE after the     */
          /* forward frame. 7 TE ~ 3ms , 22*TE ~ 9ms                          */
          /*  Use the WDT to determine the amount of time that must be waited */
          /*  after the return from the callback function.                    */
          idle_time = 0;
          TI_DALI_Idle_Callback();  //SJ3080611 - Routine's only sttmt: __no_operation();
          while(idle_time < RESPONSE_MAX_TIME);   //SJ4170512 - equiv 7*(8192/8000)=7.168
      #if 0  //SJ5070912 - ORG. Dali code
          TI_DALI_Tx(response);
      #else  //SJ2180912 - Replaced.
          //AZ_DALI_Response(3);  //SJ5070912 #define GENERIC_QUERY  3 in PLC_Comm.h
      #endif
        }
        else
        {
          TI_DALI_Idle_Callback();
        }
        TI_DALI_Reset_Check(); // if the varaibles are no longer consistent with RESET
                       // then clear the bit from the status register
      }//ignore command if does not meet length criteria  //SJ3080611 - if(bytes_received == SYSTEM_FAILURE) { ... } else if (...) { ... }
  }// END WHILE(1)
}


//#define  AZ_DEV_LOC   65//17  //SJ4061212 - For switch project //62
//#define  AZ_CMD_LOC   66//18  //SJ4061212 - For switch project //63

/******************************************************************************/
// TI_DALI_Rx                                                                 
// This function stores the received data into the array rx_msg[] and returns 
// the number of bytes receieved.  The return value is also used to report if 
// a system failure or timing violation has occured.                     
/******************************************************************************/
//SJ3080611 - SJNOTE: This routine can be used as it without changes except for the port used as input.
//SJ3150611 - This routine process incoming message sent out from DALI control unit.
unsigned char TI_DALI_Rx(unsigned char* rx_msg)
{
 #if 1  //SJ4020812 - To be replaced with our own code
    unsigned int room_ID;

    //SJ5100812 - For Quick test. Need to enhance this function.

    //rx_msg[0] = ((int) ggeneral_buffer[82] - 48);  //SJ5100812 - Device short address
    //rx_msg[1] = ((int) ggeneral_buffer[83] - 48);

    //SJ1171212 - If device type is 6, need to check if message is indeed sent to the correct room ID.
    //if (device_type == 6)  //SJ4131212 - This is temporary solution. REMOVE WHEN NO LONGER NEEDED
    //{
    //}
//DIP_switch_val = DIP_switch_val & 0x00FF;

    room_ID = (ggeneral_buffer[AZ_ROOM_ID_LOC_H] << 8) + ggeneral_buffer[AZ_ROOM_ID_LOC_L];
    if (room_ID == gstate_var.Room_ID)
    {
//AZ_ROOM_ID_LOC_H 62
//#define  AZ_ROOM_ID_LOC_L 63

        rx_msg[0] = (ggeneral_buffer[AZ_DEV_LOC]);  //SJ5100812 - Device short address
        rx_msg[1] = (ggeneral_buffer[AZ_CMD_LOC]);

        return VALID_BYTES;
    }
    else
        return AZ_INVALID_ROOM_ID;

 #else  //SJ4020812 - ORG code from TI. Skip
  unsigned long fault_check=0,stop_check=0;
  unsigned char rx_bytes,rx_bits,temp_msg;
  unsigned int rx_mask;
  rx_bytes=rx_bits=0;
  P2IE &= ~(BIT0);  //SJ3080611 - after negate equal 11111110. Purpose is to disable interrupt request when P2IFG is set.

  if(!(P2IN & BIT0))  //SJ3080611 - If sttm is true when bit 0 of port 2 is low.
  {   
    P2IES &= ~BIT0;       // Low-to-High Transition
    P2IFG &= ~BIT0;  //SJ3080611 - P2IFG will get 11111110; purpose is to clear interrupt flag
    fault_check=0;
    while (~P2IFG & BIT0)     // Wait for rising edge
    {
      //SJ3150611 - below 500*MCLK_mSEC_COUNT = 500 * 8000 = 4000000
      //SJ3150611 - If port 2 bit 0 never goes high, after 500ms report as failure.
      //SJ4160611 - With current timer setting, it takes around 16.2 seconds to get pass thru.
      if (fault_check++ > 500*MCLK_mSEC_COUNT) // Interface failure when > 500ms
      {
        return SYSTEM_FAILURE;
      }
    }
  }
  P2IES |= BIT0;        // High-to-Low Transition
  P2IFG &= ~BIT0;
  /*** START BIT ****/
  while(~P2IFG & BIT0);   // Wait for Falling Edge
  P2IES &= ~BIT0;       // Low-to-High Transition
  P2IFG &= ~BIT0;
  /****************************************************************************/
  // Fault detection: if the input is low for greater than 500ms, then the
  // light should go to the fault setting.
  /****************************************************************************/
  fault_check=0;
  while (~P2IFG & BIT0)     // Wait for rising edge
  {
    //SJ3150611 - below 505*MCLK_uSEC_COUNT = 505 * (8000/1000) = 4040
    if (fault_check++ > 505*MCLK_uSEC_COUNT) // bit failure if greater than
    {                                        // tmax = 500us
      return 0;
    }
  }
  /* Start pulse is special case, receive first bit */
  __delay_cycles(505*MCLK_uSEC_COUNT); // maximum width is 500us
  rx_msg[rx_bytes] = 0;
  rx_mask = (P2IN & BIT0) ^ BIT0;  //SJ3150611 - If high, value is 0. If low, value is 1
  rx_msg[rx_bytes] |= (rx_mask<<7);
  rx_bits++;
  /* wait for edge */
  fault_check=0;
  if (rx_mask)
  {
    P2IES &= ~BIT0;       // Low-to-High Transition
  }
  else
  { 
    P2IES |= BIT0;        // High-to-Low Transition
  }
  P2IFG &= ~BIT0;
  while (~P2IFG & BIT0)  // wait for change in state
  {
    if (fault_check++ > 505*MCLK_uSEC_COUNT) // Interface failure when > 500ms
    {
      return 0;                           // timing fault
    }                              
  }
  while (rx_bytes<VALID_BYTES)  //SJ3150611 - When this while loop starts, rx_bits is 1
  {
    P2DIR |= BIT2;  // debug
    P2OUT ^= BIT2;  // debug
    while (rx_bits <8)  //SJ3150611 - This while loop receives all subsequent 7 bits of the data byte
    {
      __delay_cycles(505*MCLK_uSEC_COUNT);
      // maximum TE is 500us + 5us for extra hold time  
      rx_mask = (P2IN & BIT0) ^ BIT0;
      fault_check=0;
      rx_mask = rx_mask<<(7-rx_bits);
      rx_msg[rx_bytes] |= rx_mask;
      rx_bits++;
      if (rx_mask)
      {
        P2IES &= ~BIT0;       // Low-to-High Transition
      }
      else
      { 
        P2IES |= BIT0;        // High-to-Low Transition
      }
      P2IFG &= ~BIT0;
      while (~P2IFG & BIT0)  // wait for change in state
      {
        if (fault_check++ > 505*MCLK_uSEC_COUNT)    
        { 
          return 0;
        } 
      }
    } // End rx_bits while loop
    /* Sample possible first bit of next byte */
    rx_bytes++;
    temp_msg = 0;
    rx_bits=0;
    stop_check=0;
    // maximum TE is 500us + 5us for extra hold time
    __delay_cycles(505*MCLK_uSEC_COUNT);  
    rx_mask = (P2IN & BIT0) ^ BIT0;
    temp_msg |= rx_mask<<7;
    rx_bits++;
    /* wait for edge */
    if (rx_mask)
    {
      P2IES &= ~BIT0;       // Low-to-High Transition
    }
    else
    { 
      P2IES |= BIT0;        // High-to-Low Transition
    }
    P2IFG &= ~BIT0;
    while (~P2IFG & BIT0)  // wait for change in state
    {
      /*check to see if no edges have occured, then this is a stop condition*/
      /* Stop bits are 4*TE or 4*416.67us = 1667                            */
      /* x cycles per while loop                                            */
      if (stop_check > 50*MCLK_uSEC_COUNT) 
      {   
        P2DIR |= BIT2;  // debug  //SJ3150611 - Set pin 3 of port 2 as output
        P2OUT ^= BIT2;  // debug
        return rx_bytes;
      }
      stop_check++;
    }
      if(rx_bytes >= VALID_BYTES)
      {
        return 0;
      }
      else
      {
        rx_msg[rx_bytes] = temp_msg;  //SJ3150611 - Bit 7 of second byte.
      }
  } // End rx_bytes Whileloop
  return 0;
 #endif  //SJ4020812 - #if 1 ... #else ... #endif
}

/******************************************************************************/
// TI_DALI_Tx(response)                                                       
// This function transmits the query response. The response is requested by   
// the command query.                                                         
// P2.1 is TX line                                                            
// Start bit, data byte, 2 stop bits (idle line)                              
/******************************************************************************/

void TI_DALI_Tx(unsigned char response)
{
 #if 1  //SJ4020812 - To be replaced with our own code
 ;
 #else  //SJ4020812 - ORG code from TI. Skip.
  unsigned char bit_mask=0x80;
  P2IE &= ~(BIT1);
  /* Start Bit  */
  P2OUT &= ~BIT1;
  __delay_cycles(416*MCLK_uSEC_COUNT);
  P2OUT |= BIT1;
  __delay_cycles(416*MCLK_uSEC_COUNT);
  while(bit_mask)
  {
    if(bit_mask & response)
    { /* transmit a '1' */
      P2OUT &= ~BIT1;
      __delay_cycles(416*MCLK_uSEC_COUNT);
      P2OUT |= BIT1;
      __delay_cycles(416*MCLK_uSEC_COUNT);
    }
    else
    { /* transmit a '0' */
      P2OUT |= BIT1;
      __delay_cycles(416*MCLK_uSEC_COUNT);
      P2OUT &= ~BIT1;
      __delay_cycles(416*MCLK_uSEC_COUNT);
    }
    bit_mask = bit_mask >> 1;
  }
  P2OUT |= BIT1; /* IDLE condition */
 #endif  //SJ4020812 - #if 1 ... #else ... #endif
}

/******************************************************************************/
// TI_DALI_Match_Address()                                                    
//                                                                            
// Is the address field a Broadcast, group, or short address                  
// rx_msg[0]?= broadcast (b)                                                  
//          ?= group     (g)                                                  
//          ?= short     (s)                                                  
// Return a 1 if it is a match with either a b,g, or s                        
// return a 2 if it is a special command                                      
/******************************************************************************/
unsigned char TI_DALI_Match_Address(unsigned char address){
  unsigned char temp;
  //SJ4090611 - SJNOTE: Sepcial commands ranges from 177 to 199
  //SJ4090611 -         Group address ranges from 128 to 159
  //SJ4090611 -         Broadcast address are 254 and 255
  //SJ1060812 - 0x9F = 10011111 (159), 0xFE = 11111110 (254)
  if((address > 0x9F) && (address < 0xFE))  //SJ4090611 - equiv 159 and 254
  {
    /* Special commands are address 0xB1 through 0xC7         */
    /* while valid address values range from 0x00 to 0x7F     */
    /* group address values range from 0x80 to 0x9F           */
    /* and the broadcast address values are 0xFE and 0xFF     */
    return 2;
  }
  if(address & BIT7)  //SJ4090611 - If bit 7 is on, either broadcast or group addressing.
  {/* group or broadcast */
    address = address>>1;
    address = address & 0x7F;  //SJ4090611 - Here we extract 7 bits
    if(address==0x7F)  //SJ5170611 - If true, address is likely either 254 or 255
    {
      return 1; /* broadcast message */
    }
    address = address & 0x0F;  /* group id is now in lower nibble */
    temp = 0x01;
    if(address<8)
    {
      temp = temp<<address;
      if(temp & group_0_7)  //SJ4090611 - group_0_7 = 0x00
      {
        return 1;
      }
    }
    else
    {
      address = address - 8;
      temp = temp<<address;
      if(temp & group_8_f)  //SJ4090611 - group_8_f = 0x00
      {
        return 1;
      }
    }
    return 0;  //SJ5191012 - Added by SJ to solve TI bug
    //SJ5170611 - SJNOTE: Why group_0_7 and group_8_f address are the same - 0x00 ???
  }
  //SJ5170611 - If reaches here, address is below 127 inclusive
  address = address>>1;
  address = address & 0x3F;  //SJ4090611 - Here we extract 6 bits. Short addr is less than 63 inclusive

