Suilarso/Aztech/MSP430G2553_PLC_iSwitch/dali.c
  if(address == short_address)  //SJ4090611 - short_address retrieve from flash info area
  {
    return 1;
  }
  else
  {
    return 0;
  }
}

/******************************************************************************/
// TI_DALI_Reset_Check()                     
// If the values in the information register match the RESET value
// , then the RESET bit must be set                               
/******************************************************************************/
void TI_DALI_Reset_Check(void)
{
  if(actual_level != ACTUAL_LEVEL_RESET)
  {
    status_information &= ~RESET_STATE;   //SJ5140912 - #define RESET_STATE BIT5
    return;
  }
  if(system_failure_level != SYSTEM_FAILURE_LEVEL_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }
  if(power_on_level != POWER_ON_LEVEL_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }
  if(min_level != MIN_LEVEL_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }  
  if(max_level != MAX_LEVEL_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }    
  if(fade_rate != FADE_RATE_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }    
  if(fade_time != FADE_TIME_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }    
  if(fade_time != FADE_TIME_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }    
  if(group_0_7 != GROUP_0_7_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }    
  if(group_8_f != GROUP_8_F_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }    
  if(scene[0] != SCENE_0_F_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }    
  if(dimming_curve != DIMMING_CURVE_RESET)
  {
    status_information &= ~RESET_STATE;
    return;
  }
  status_information |= RESET_STATE;
}


/******************************************************************************/
// TI_Flash_Update(FWKEY)                                                     
// Use the FLASH Controller to save these non-volatile settings. These        
// settings will be used on the next Power up.                                
/******************************************************************************/
//void TI_DALI_Flash_Update(unsigned int key)
void TI_DALI_Flash_Update(unsigned int key, unsigned char wrt_area)  //SJ1171212 - Replaced
{
    /* move data to next location */
    volatile unsigned char i;
  #if 1  //SJ3190912 - Added
    unsigned char temp_infoC[INFO_C_LAST_LOC];  //SJ2111212 - 16 elements

    unsigned short crcvalue=0;    //SJ3190912 - Added by SJ
    //unsigned short stored_crc=0;  //SJ3190912 - Added by SJ

    //SJ3190912 - Backup info C to local array before info C is erased
    for (i=0; i<INFO_C_LAST_LOC; i++)
      temp_infoC[i] = infoC_ptr[i];
  #endif

    IE1 &= ~WDTIE;
    WDTCTL = WDTPW+WDTHOLD;  // stop the WDT
    FCTL2 = key+FSSEL0+FLASH_DIVIDER; // 333kHz Flash Timing Generator
    FCTL3 = key;
//--- SJ1171212 - Start of flash write -----------------------------------------
  #if 1  //SJ2180912 - SJ
    FCTL1 = key+ERASE;
    //--- SJ1171212 - Introduce if sttmt to allow writing to 0x1080 ------------
    #ifdef SWITCH_CONTROLLER
    if (wrt_area == 1)  //SJ1171212 - Write to segment B 0x1080
    {
      infoB_ptr[0] = 0;  //SJ1171212 - Dummy write to info B
      FCTL1 = key+WRT;
      for (i=0; i<SWITCH_OPER_SZ; i++)  //SJ1171212 - SWITCH_OPER_SZ is 64
      {
        infoB_ptr[i] = gswitch_oper[i];
      }
    }
    else
    #endif
    //--- SJ1171212 - END of new added codes. Writing 0x1080 -------------------
    {
    flash_ptr[POWER_ON_LEVEL] = 0;  //SJ2180912 - Dummy write

    __no_operation();
    __no_operation();
    __no_operation();

    //gstate_var.general_delay = 2;
    //while (gstate_var.general_delay) ;

    FCTL1 = key+ERASE;
    infoC_ptr[0] = 0;  //SJ3190912 - Dummy write info C #define PLC_LONG_ADDR_8_LOC 0 in global_var.h
  #endif
    FCTL1 = key+WRT;
    flash_ptr[POWER_ON_LEVEL] = power_on_level;
    flash_ptr[SYSTEM_FAILURE_LEVEL] = system_failure_level;
    flash_ptr[MIN_LEVEL] = min_level;
    flash_ptr[MAX_LEVEL] = max_level;
    flash_ptr[FADE_RATE] = fade_rate;
    flash_ptr[FADE_TIME] = fade_time;
    flash_ptr[SHORT_ADDRESS] = short_address;
    flash_ptr[GROUP_0_7] = group_0_7;
    flash_ptr[GROUP_8_F] = group_8_f;
    for(i=0;i<NUMBER_OF_SCENES;i++)
    {
      flash_ptr[i+SCENE_0]= scene[i];
    }
    flash_ptr[RANDOM_ADDRESS_H] = random_address_byte_h;
    flash_ptr[RANDOM_ADDRESS_M] = random_address_byte_m;
    flash_ptr[RANDOM_ADDRESS_L] = random_address_byte_l;
    flash_ptr[FAST_FADE_TIME] = fast_fade_time;
    flash_ptr[FAILURE_STATUS] = failure_status;
    flash_ptr[OPERATING_MODE] = operating_mode;
    flash_ptr[DIMMING_CURVE] = dimming_curve;
    /* scene o through 15 are set to FF which is the value of erased flash */

  #if 1  //SJ3190912 - Added by SJ
    __no_operation();
    __no_operation();
    __no_operation();

//  gstate_var.general_delay = 2;
//  while (gstate_var.general_delay) ;

    CRC16_UpdateChecksum(&crcvalue, (const void *) flash_ptr, DATA_SIZE);

    temp_infoC[PLC_LONG_ADDR_1_LOC] = short_address;
    //temp_infoC[CRC_CHECKSUM_MSB] = (crcvalue & 0xFF00) >> 8;
    temp_infoC[CRC_CHECKSUM_MSB] = (unsigned char) (crcvalue >> 8);
    temp_infoC[CRC_CHECKSUM_LSB] = (unsigned char) crcvalue; //(crcvalue & 0x00FF);
    //*(temp_infoC+CRC_CHECKSUM_MSB) = crcvalue;

//#define PLC_LONG_ADDR_8_LOC   0   //SJ3190912 - PLC G3 long address byte 0
//#define PLC_LONG_ADDR_7_LOC   1
//#define PLC_LONG_ADDR_6_LOC   2
//#define PLC_LONG_ADDR_5_LOC   3
//#define PLC_LONG_ADDR_4_LOC   4
//#define PLC_LONG_ADDR_3_LOC   5   //SJ3190912 - PLC G3 long address byte 5
//#define PLC_LONG_ADDR_2_LOC   6   //SJ3190912 - Future use for expansion DALI short address from 1 byte to 2 bytes
//#define PLC_LONG_ADDR_1_LOC   7   //SJ3190912 - Contains DALI short address
//#define CRC_CHECKSUM_MSB      8   //SJ3190912 - CRC checksum MSB
//#define CRC_CHECKSUM_LSB      9   //SJ3190912 - CRC checksum LSB
//#define INFO_C_LAST_LOC      10
//#define DEVICE_TYPE_LOC      10
//#define ROOM_ID_MSB_LOC      11
//#define ROOM_ID_LSB_LOC      12
//#define PRODUCT_ID_LOC       13
//#define RELEASE_CODE_LOC     14
//#define VERSION_CODE_LOC     15
//#define INFO_C_LAST_LOC      16

    infoC_ptr[PLC_LONG_ADDR_8_LOC] = temp_infoC[PLC_LONG_ADDR_8_LOC];  //SJ3190912 - 0
    infoC_ptr[PLC_LONG_ADDR_7_LOC] = temp_infoC[PLC_LONG_ADDR_7_LOC];
    infoC_ptr[PLC_LONG_ADDR_6_LOC] = temp_infoC[PLC_LONG_ADDR_6_LOC];
    infoC_ptr[PLC_LONG_ADDR_5_LOC] = temp_infoC[PLC_LONG_ADDR_5_LOC];
    infoC_ptr[PLC_LONG_ADDR_4_LOC] = temp_infoC[PLC_LONG_ADDR_4_LOC];
    infoC_ptr[PLC_LONG_ADDR_3_LOC] = temp_infoC[PLC_LONG_ADDR_3_LOC];
    infoC_ptr[PLC_LONG_ADDR_2_LOC] = temp_infoC[PLC_LONG_ADDR_2_LOC];
    infoC_ptr[PLC_LONG_ADDR_1_LOC] = temp_infoC[PLC_LONG_ADDR_1_LOC];  //SJ3190912 - 7, Dali short addressed is stored here
    infoC_ptr[CRC_CHECKSUM_MSB] = temp_infoC[CRC_CHECKSUM_MSB];
    infoC_ptr[CRC_CHECKSUM_LSB] = temp_infoC[CRC_CHECKSUM_LSB];  //SJ3190912 - 9
    infoC_ptr[DEVICE_TYPE_LOC] = temp_infoC[DEVICE_TYPE_LOC];
    infoC_ptr[ROOM_ID_MSB_LOC] = (unsigned char) ((gstate_var.Room_ID & 0xFF00) >> 8);
    infoC_ptr[ROOM_ID_LSB_LOC] = (unsigned char) (gstate_var.Room_ID & 0x00FF);
    infoC_ptr[PRODUCT_ID_LOC] = temp_infoC[PRODUCT_ID_LOC];  //SJ3190912 - 7, Dali short addressed is stored here
    infoC_ptr[RELEASE_CODE_LOC] = temp_infoC[RELEASE_CODE_LOC];
    infoC_ptr[VERSION_CODE_LOC] = temp_infoC[VERSION_CODE_LOC];  //SJ3190912 - 9
  #endif  //SJ3190912 - #if 1 ... #endif. End of Added by SJ
    }  //SJ1171212 - if () { ... } else { ... }
//--- SJ1171212 - End of flash write -------------------------------------------

