Suilarso/Aztech/MSP430G2553_PLC_iSwitch/dali.c
    FCTL1 = key;  /* lock flash */
    FCTL3 = key+LOCK;
    /* update the global pointer */

    //SJ4200912 - Below watchdog timer is better moved outside
  #if 0//SJ1100912 - Below two sttmts added by SJ
    WDTCTL = FADE_INTERVAL;  //SJ4300812 - equiv (WDT_MDLY_8 - SMCLK/8192), 1 second will goto ISR 977 times.
    IE1 |= WDTIE;
  #endif
}


/******************************************************************************/
// Watch Dog Timer in Interval Mode                                           
// The DALI specficiation requires that the device fade to the requested power
// level.  The fade rate can be one of 14 values defined in the DALI standard.
// This function uses the periodic interval of the WDT to determine if the
// power level needs to be updates because the controller is fading to a      
// requested level.                                                           
// Timer is also used to evaluate four different time delays:                 
// Direct Arc Power Sequence (200ms)                                          
// Configuration (100ms)                                                      
// Initialisation (15 minutes)                                                
// Response idle time (7ms)                                                   
/******************************************************************************/
//SJ3050912 - SMCLK=8MHz interval=8192 --> 8000000/8192 ~ 977. Each second this ISR will be run 977 times
#pragma vector=WDT_VECTOR
__interrupt void ISR_WDT(void)
{
  if(status_information & FADE_RUNNING)   //SJ4300812 - FADE_RUNNING is BIT4
  {
    if(fade_count == fade_step_size)
    {
      fade_count=0;
      if(target_level > actual_level)
      {
        actual_level++;
      }
      if(target_level < actual_level) 
      {
        actual_level--;
      }
      if(actual_level == target_level)
      {
        status_information &= ~FADE_RUNNING;
        if(target_level == (min_level-1)) 
        {                         // special case of fade to min and then off   
          actual_level=OFF;       
          status_information &= ~LAMP_ARC_POWER_ON;
        }
      }
      TI_DALI_Update_Callback();
    }
    else fade_count++;    
  }
  /* If the control gear does not receive a power level command within 0.6 */
  /* seconds, then the control shall go to the power_on_level immediately */
  if(start_time<POWER_ON_TIME)         
  {
    start_time++;
    if((start_time == POWER_ON_TIME) && (actual_level == power_on_level))
    {
      TI_DALI_Update_Callback();
    }
  }
  /* The control gear must respone within 7 to 22 TE or 3 to 9 ms */
  if(idle_time<RESPONSE_MAX_TIME)         
  {
    idle_time++;
  }
  /* Configuration commands must be duplicated */
  /* within 100ms or they are ignored */
  //SJ4060912 - Becomes valid when command 32 to 128 are issued.
  if(config_count<CONFIG_TIMEOUT)   //SJ3050912 - CONFIG_TIMEOUT = 98 it represents 100ms
  {
    config_count++;
  }
  /* DAPC sequence  */
  if(dapc_count<DAPC_TIMEOUT)  //SJ4060912 - Becomes valid when ENABLE_DAPC_SEQ command is issued.
  {
    dapc_count++;
  }
  /* Initialise sequence 15 minutes or 15*60*1000 = 15*60000 */
  if(initialise_count<INITIALISE_SEC)  //SJ2120612 - equiv 58594
  {
    initialise_count++;
  }
  else 
  {
    initialise_count=0;
    initialise_minute++;
    if(initialise_minute == INITIALISE_MIN)  //SJ3050912 - INITIALISE_MIN is 15 minutes
    {
      initialise_count=INITIALISE_SEC;
      initialise_minute = 0;
    }  
  }
} // END WDT ISR


